package task1;

public interface InterfaceB {
    public void prints();
    public void printb();
    public void min();
    public double div();
    public void setRandom();
    public void setA();
    public void print10B();
}


//მეთოდი 1: ბეჭდავს s ცვლადის მნიშვნელობას;
//        მეთოდი 2: ბეჭდავს a ცვლადის მნიშვნელობას;
//        მეთოდი 3: ბეჭდავს b ცვლადის მნიშვნელობას;
//        მეთოდი 4: ბეჭდავს a და b ცვლადების სხვაობას;
//        მეთოდი 5: აბრუნებს a და b ცვლადების განაყოფს;
//        მეთოდი 6: ანიჭებს ცვლადებს სხვა ნებისმიერ შესაბამისი ტიპის მნიშვნელობას;
//        მეთოდი 7: ანიჭებს a ცვლადს მნიშვნელობას კლავიატურიდან;
//        მეთოდი 8: ბეჭდავს b ცვლადზე 10-ით მეტ რიცხვს.
