package task1;

public interface InterfaceC {
    public void printInt();
    public void printChar();
    public void PrintSumDivisionMultiplication();
    public void setA();
    public void setB();
    public void SetChar();
}

//მეთოდი 1: ბეჭდავს მთელი ტიპის ცვლადების მნიშვნელობებს;
//მეთოდი 2: ბეჭდავს სიმბოლური ტიპის ცვლადების მნიშვნელობებს;
//მეთოდი 3: ბეჭდავს a და b ცვლადების ჯამს, ნამრავლს, სხვაობას, ნაშთიან
//გაყოფას ცალ-ცალკე სტრიქონზე;
//მეთოდი 4: ანიჭებს a ცვლადს მნიშვნელობას კლავიატურიდან;
//მეთოდი 5: ანიჭებს b ცვლადს მნიშვნელობას კლავიატურიდან;
//მეთოდი 6: ანიჭებს სიმბოლური ტიპის ცვლადებს მნიშვნელობებს
//კლავიატურიდან;