package task2;

public interface InterfaceA {
    public void setAB();
    public int[]getAB();
    public char[]getABC();
    public void setM();
    public void getEven();
    public void sumPositive();
    public void minPositive();
}

//მეთოდი 1: ანიჭებს a და b ცვლადებს შემთხვევით მნიშვნელობებს [10; 25]
//შუალედიდან ;
//მეთოდი 2: აბრუნებს a და b ცვლადების მნიშვნელობებს;
//მეთოდი 3: აბრუნებს a და b ცვლადების მნიშვნელობებს შესაბამის
//სიმბოლოებს;
//მეთოდი 4: ანიჭებს m მასივს შემთხვევით მნიშვნელობებს [-10; 60]
//შუალედიდან;
//მეთოდი 5: ბეჭდავს m მასივს ლუწ ელემენტებს;
//მეთოდი 6: ბეჭდავს m მასივს დადებითი ელემენტების ჯამს;
//მეთოდი 7: ბეჭდავს m მასივს დადებით ელემენტებს შორის მინიმალურს.